---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.Reset
source: html/181954ef-de0b-34ad-65de-5f1d11b98352.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```